Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཐ་མ་མཐོང་བ་དང་། སེམས་ཅན་རིགས་མཐོ་བ་དང་། རིགས་དམའ་བ་མཐོང་ན་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་རྣམས་ཀྱི་ཉེས་པ་འདི་དག་མི་འབྱུང་ཞིང་མི་སྲིད་པ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: IV: 185} “Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings of higher, average, and lower status, and if they see beings of upper classes and lower classes, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until these faults of beings no longer occur and are impossible.

source: རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the six perfections.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་ཁ་དོག་ཐ་དད་པ་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings of different color, they should reflect, “In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until beings can no longer be distinguished by their color, and that to so distinguish them is impossible.

source: སེམས་ཅན་རྣམས་ཁ་དོག་ཐ་དད་པ་མི་འབྱུང་ཞིང་མི་སྲིད་པ་དང་གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་གཟུགས་བཟང་ཞིང་མཛེས་ལ། བལྟ་ན་སྡུག་པ་དང་། ཁ་དོག་བཟང་བའི་མཆོག་རྒྱས་པ་དང་ལྡན་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Rather, all beings will acquire a fine and splendid physique, beautiful to behold, and the finest of complexions.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་དག་ལ་བདག་པོ་ཡོད་པར་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings with feudal masters, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until even the designation feudal master is no longer heard and to have such positions will be impossible.

source: བདག་པོར་གདགས་པ་མི་འབྱུང་ཞིང་མི་སྲིད་པ་དང་། གཞན་དུ་ན་ཆོས་ཀྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་བཞུགས་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Rather, the kings of the Dharma—tathāgatas, arhats, completely awakened buddhas—will be present.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་ཀྱི་ལམ་ཐ་དད་པ་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་ལྷ་དང་མི་དང་སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see the different pathways of beings, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, the different pathways of beings—the god realms, the human realm, the realms of the denizens of the hells, the animal realm, and the world of Yama—will be nonexistent, and to follow them will be impossible.

source: གཤིན་རྗེའི་འཇིག་རྟེན་པའི་ལམ་ཐ་དད་པ་མེད་ཅིང་མི་སྲིད་པ་དང་། གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་ལམ་གཅིག་ཏུ་འགྱུར་ཞིང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་མ་བྲལ་བ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་།
en: In their place, all beings will follow a single pathway. {

source: དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: Ki.

source: མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་མ་བྲལ་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: IV: 186} I will practice the six perfections until they are not separated from the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་གནས་བཞིར་སྐྱེས་པ་སྒོ་ང་ལས་སྐྱེས་པ་དང་། མངལ་ནས་སྐྱེས་པ་དང་། དྲོད་གཤེར་ལས་སྐྱེས་པ་དང་། རྫུས་ཏེ་སྐྱེས་པ་རྣམས་མཐོང་ན་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see the four distinct modes of birth of beings, namely oviparous birth, viviparous birth, birth from heat and moisture, and miraculous birth, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until the three [lower] modes of birth [of beings]—oviparous birth, viviparous birth, and birth from heat and moisture—do not occur, and would be impossible.

source: སྒོ་ང་ལས་སྐྱེས་པ་དང་། མངལ་ནས་སྐྱེས་པ་དང་། དྲོད་གཤེར་ལས་སྐྱེས་པའི་གནས་གསུམ་པོ་རྣམས་མི་འབྱུང་ཞིང་མི་སྲིད་པ་དང་། གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་རྫུ་བ་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: In their place, all beings will be born miraculously.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་མངོན་པར་ཤེས་པ་ལྔ་དང་མི་ལྡན་པ་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་ཐམས་ཅད་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings lacking the five extrasensory powers, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until all beings are endowed with the five extrasensory powers.

source: །ཞེས་དེ་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the six perfections.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་ཀྱི་གཤང་གཅི་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་ཐམས་ཅད་ཆོས་དང་དགའ་བ་དང་བསམ་གཏན་གྱི་ཟས་ཟ་བར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see the excrement and urine of beings, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until all beings partake of the nourishment of the Dharma, the nourishment of delight, and the nourishment of meditative concentration.

source: རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཀྱང་། ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the six perfections.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་ཉེ་བར་གྱུར་པ་ཡིན་ནོ།། །། །། །།།། །། །། །༄༅༅། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: They will also approach all-aspect omniscience. “

source: དུམ་བུ་གསུམ་པ་སྟེ་ཐ་མའོ། །བམ་པོ་ལྔ་བཅུ་གསུམ་པ། རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། འོད་དང་མི་ལྡན་པའི་སེམས་ཅན་དག་མཐོང་ན་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings bereft of luminosity, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, {Ki.

source: སེམས་ཅན་ཐམས་ཅད་རང་ལས་འོད་འབྱུང་བ་ཤ་སྟག་ཡོད་པ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: IV: 187} I will practice the six perfections until luminosity absolutely emerges from all beings themselves.

source: རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the six perfections.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་ཀྱི་ཉིན་མཚན་དང་། ཟླ་བ་དང་ཡུད་དུ་ཡན་མན་དང་། དུས་མཚམས་དང་ལོ་དག་མཐོང་ན་དེ་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་རྣམས་ཀྱི་ཉིན་མཚན་དང་ཟླ་བ་དང་ཡུད་དུ་ཡན་མན་དང་། དུས་མཚམས་དང་ལོའི་སྒྲ་ཡང་མི་གྲག་ཅིང་མི་སྲིད་པ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see among beings the temporal divisions of day, night, month, fortnight, season, and year, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until even the words for the temporal divisions of day, night, month, fortnight, season, and year, as employed by beings, are unknown and no longer exist.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་ཚེ་དང་མི་ལྡན་པ་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་ཐམས་ཅད་ཚེ་དཔག་ཏུ་མེད་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings bereft of long life, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until all beings possess an inestimable lifespan.

source: །ཞེས་དེ་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the six perfections.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་མཚན་དང་མི་ལྡན་པ་དག་མཐོང་ན་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་ཐམས་ཅད་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings bereft of the major marks, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until all beings possess the thirty-two major marks of a great person.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་དགེ་བའི་རྩ་བ་དག་དང་མི་ལྡན་པ་མཐོང་ན་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་ཐམས་ཅད་དགེ་བའི་རྩ་བ་དང་ལྡན་པར་འགྱུར་བ་དང་། དགེ་བའི་རྩ་བ་གང་དང་ལྡན་པས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings bereft of the roots of virtuous action, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until all beings possess the roots of virtuous action, and honor the lord buddhas with the roots of their virtuous actions.

source: །ཞེས་དེ་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ་རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the six perfections.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་ཉེ་བར་གྱུར་པ་ཡིན་ནོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་ནད་ཀྱིས་བཏབ་པ་དག་མཐོང་ན།
en: They will also approach all-aspect omniscience. {

source: ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་རྣམས་ལ་རླུང་དང་། མཁྲིས་པ་དང་། བད་ཀན་དང་། འདུས་པའི་ནད་བཞི་མེད་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: IV: 188} “Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings afflicted by disease, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until beings are free from the four kinds of disease, namely wind disorders, bile disorders, phlegm disorders, and combined humoral disorders.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། ཉོན་མོངས་པ་གསུམ་གྱིས་ཉོན་མོངས་པར་གྱུར་པའི་སེམས་ཅན་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། འདི་ལྟ་སྟེ་སེམས་ཅན་རྣམས་ལ་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་གི་ཉོན་མོངས་པ་གསུམ་མི་འབྱུང་ཞིང་སེམས་ཅན་ཐམས་ཅད་ཀྱང་འདོད་ཆགས་དང་བྲལ་བ་ཞེ་སྡང་དང་བྲལ་བ་གཏི་མུག་དང་བྲལ་བར་གྱུར་པ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings smitten by the three afflicted mental states, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until for all beings the afflicted mental states of desire, hatred, and delusion no longer arise, and all beings are indeed bereft of desire, hatred, and delusion.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་མོས་པ་ཆུང་ངུ་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་ཐེག་པ་གཉིས་ཀྱི་སྒྲ་ཡང་མི་གྲག་ཅིང་། སེམས་ཅན་ཐམས་ཅད་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡང་དག་པར་ཞུགས་པར་གྱུར་པ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings of inferior resolve, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until even the words for the two [lower] vehicles—the vehicle of the śrāvakas and the vehicle of the pratyekabuddhas—are no longer heard, and until all beings indeed have set out for all-aspect omniscience.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་ང་རྒྱལ་ཅན་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ང་རྒྱལ་ཅན་གྱི་སྒྲ་ཡང་མི་གྲག་ཅིང་། གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་ཡང་དག་པའི་དོན་ཤེས་ཤིང་། ང་རྒྱལ་མེད་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see conceited beings, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until even the word conceited is no longer heard, and, apart from that, until all beings indeed understand genuine reality and are without conceit.

source: །ཞེས་དེ་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ་རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Ki.IV: 189} Subhūti, bodhisattva great beings who practice accordingly will indeed complete the six perfections.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཚེ་ལ་ཚད་དུ་འགྱུར་བ་དང་། འོད་ལ་ཚད་དུ་འགྱུར་བ་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་ཚད་དུ་འགྱུར་བ་དེ་ཙམ་གྱིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བྱའི། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཚེ་ཚད་མེད་པར་འགྱུར་བ་དང་། འོད་ཚད་མེད་པར་འགྱུར་བ་དང་། དགེ་སློང་གི་དགེ་འདུན་ཚད་མེད་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, they should reflect, ‘In this buddhafield where I attain consummate buddhahood in unsurpassed, complete enlightenment, I will not attain consummate buddhahood in unsurpassed, complete enlightenment merely with a limited lifespan, a limited luminosity, and a limited community of monks, but in this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until I have an immeasurable lifespan, an immeasurable luminosity, and an immeasurable community of monks.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་ཉེ་བར་གྱུར་པ་ཡིན་ནོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ།
en: They will also approach all-aspect omniscience. “

source: འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་འགའ་ཞིག་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྱུར་བ་དེ་ཙམ་གྱིས། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བྱའི། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཚེ། གང་གཱའི་ཀླུང་ལ་བྱེ་མ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ཏུ་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, they should reflect, ‘I will not attain consummate buddhahood in unsurpassed, complete enlightenment merely by transforming a few worlds into my buddhafield, but when I have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, as many worlds as there are, numerous as the grains of sand of the river Gaṅgā, will become one with my buddhafield.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, they should reflect, ‘Alas!

source: ཀྱེ་མ་འཁོར་བ་འདི་ནི་རིང་ངོ་།
en: This cyclic existence is long-lasting. Alas!

source: །ཀྱེ་མ་སེམས་ཅན་གྱི་ཁམས་འདི་ནི་མཐའ་ཡས་སོ།
en: This world of beings is infinite.’

source: །དེས་འདི་ལྟར་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱ་སྟེ།
en: They should be focus their attention correctly, saying, ‘Alas!

source: ཀྱེ་མ་འཁོར་བ་འདི་ནི་ནམ་མཁའ་ལྟར་མུ་མེད་པའོ།
en: This cyclic existence is limitless like space. Alas!

source: །ཀྱེ་མ་སེམས་ཅན་གྱི་ཁམས་འདི་ནི་ནམ་མཁའ་ལྟར་མུ་མེད་པ་སྟེ།
en: This world of beings is limitless like space.

source: འདི་ལ་གང་ཡང་འཁོར་བ་ཡང་མེད། མྱ་ངན་ལས་འདས་པ་ཡང་མེད་དེ།
en: But in it there is no cyclic existence, nor is there nirvāṇa.

source: གཞན་དུ་ན་ཆོས་ཀྱི་བརྡར་སེམས་ཅན་ནམ། འཁོར་བ་འམ། མྱ་ངན་ལས་འདས་པ་ཞེས་ཐ་སྙད་དུ་བཏགས་པར་ཟད་དོ་ཞེས་དེ་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ།
en: Rather, terms such as being, cyclic existence, and nirvāṇa are merely conventional designations.’

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་བཞི་བཅུ་གཉིས་པའོ།། །།
en: This completes the forty-second chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་འཁོར་དེར་གང་གཱའི་ལྷ་མོ་ཞེས་བྱ་བའི་བུད་མེད་གཅིག་འདུས་ཏེ།
en: Chapter 43: Gaṅgadevī Then a woman named Gaṅgadevī arrived in that assembly and took her seat.

source: འདུག་པར་གྱུར་པ་དེ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Then, after rising from her seat, with her upper robe over one shoulder, she rested her right knee on the ground.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བས་བཏུད་ནས།
en: Placing her hands together in the gesture of homage, she bowed toward the Blessed One {Ki.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བགྱི་སྟེ།
en: IV: 190} and said, “Blessed Lord, I too will complete the six perfections.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཇི་སྐད་དུ་བསྟན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ལྟ་བུ་ཡོངས་སུ་གཟུང་བར་བགྱིའོ་ཞེས་ནས།
en: I will acquire such a buddhafield as has been described by the Tathāgata, Arhat, completely awakened Buddha in this Perfection of Wisdom.”

source: བུད་མེད་དེས་གསེར་གྱི་མེ་ཏོག་དང་དངུལ་གྱི་མེ་ཏོག་དང་། ཆུ་ལས་སྐྱེས་པའི་མེ་ཏོག་དང་། ཐང་ལས་སྐྱེས་པའི་མེ་ཏོག་དང་། རྒྱན་ཐམས་ཅད་དང་གསེར་གྱི་ཁ་དོག་གི་ན་བཟའ་ཕྲུགས་སུ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་གཏོར་ཏོ།
en: Then that woman bundled together golden flowers, silver flowers, flowers from water plants, flowers from the plains, all sorts of ornaments, and golden colored robes, and she cast them toward that place when the Blessed One was.

source: །མེ་ཏོག་དང་རྒྱན་དང་ན་བཟའ་ཕྲུགས་སུ་སྦྱར་བ་དེ་དག་གཏོར་མ་ཐག་ཏུ་དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་དྲང་ཐད་སྟེང་གི་ནམ་མཁའ་ལ་ཁང་པ་བརྩེགས་པ་གྲྭ་བཞི་དང་ལྡན་པ། ཀ་བ་བཞི་ཟུག་པ། ཆ་མཉམ་པ་ཤིན་དུ་སྤྲོ་བ་མདངས་དགའ་བ་ཡིད་དུ་འོང་བར་གནས་པར་གྱུར་ཏོ།
en: Immediately after she had cast those flowers, ornaments, and robes, bundled together, then by the power of the buddhas, there appeared a towering mansion in the sky directly above the head of the Blessed One—rectangular in shape, supported by four columns, well proportioned, and most delightful, its luster pleasing to the mind.
